; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p12---int100n150-m25---int100c150---s187---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 - fuellevel
)

(:init
(sum level0 level11 level11)
(sum level0 level13 level13)
(sum level0 level18 level18)
(sum level1 level11 level12)
(sum level1 level13 level14)
(sum level1 level18 level19)
(sum level2 level11 level13)
(sum level2 level13 level15)
(sum level2 level18 level20)
(sum level3 level11 level14)
(sum level3 level13 level16)
(sum level3 level18 level21)
(sum level4 level11 level15)
(sum level4 level13 level17)
(sum level4 level18 level22)
(sum level5 level11 level16)
(sum level5 level13 level18)
(sum level5 level18 level23)
(sum level6 level11 level17)
(sum level6 level13 level19)
(sum level6 level18 level24)
(sum level7 level11 level18)
(sum level7 level13 level20)
(sum level7 level18 level25)
(sum level8 level11 level19)
(sum level8 level13 level21)
(sum level8 level18 level26)
(sum level9 level11 level20)
(sum level9 level13 level22)
(sum level9 level18 level27)
(sum level10 level11 level21)
(sum level10 level13 level23)
(sum level10 level18 level28)
(sum level11 level11 level22)
(sum level11 level13 level24)
(sum level11 level18 level29)
(sum level12 level11 level23)
(sum level12 level13 level25)
(sum level12 level18 level30)
(sum level13 level11 level24)
(sum level13 level13 level26)
(sum level13 level18 level31)
(sum level14 level11 level25)
(sum level14 level13 level27)
(sum level14 level18 level32)
(sum level15 level11 level26)
(sum level15 level13 level28)
(sum level15 level18 level33)
(sum level16 level11 level27)
(sum level16 level13 level29)
(sum level16 level18 level34)
(sum level17 level11 level28)
(sum level17 level13 level30)
(sum level17 level18 level35)
(sum level18 level11 level29)
(sum level18 level13 level31)
(sum level18 level18 level36)
(sum level19 level11 level30)
(sum level19 level13 level32)
(sum level19 level18 level37)
(sum level20 level11 level31)
(sum level20 level13 level33)
(sum level20 level18 level38)
(sum level21 level11 level32)
(sum level21 level13 level34)
(sum level21 level18 level39)
(sum level22 level11 level33)
(sum level22 level13 level35)
(sum level22 level18 level40)
(sum level23 level11 level34)
(sum level23 level13 level36)
(sum level23 level18 level41)
(sum level24 level11 level35)
(sum level24 level13 level37)
(sum level24 level18 level42)
(sum level25 level11 level36)
(sum level25 level13 level38)
(sum level25 level18 level43)
(sum level26 level11 level37)
(sum level26 level13 level39)
(sum level26 level18 level44)
(sum level27 level11 level38)
(sum level27 level13 level40)
(sum level27 level18 level45)
(sum level28 level11 level39)
(sum level28 level13 level41)
(sum level28 level18 level46)
(sum level29 level11 level40)
(sum level29 level13 level42)
(sum level29 level18 level47)
(sum level30 level11 level41)
(sum level30 level13 level43)
(sum level30 level18 level48)
(sum level31 level11 level42)
(sum level31 level13 level44)
(sum level31 level18 level49)
(sum level32 level11 level43)
(sum level32 level13 level45)
(sum level32 level18 level50)
(sum level33 level11 level44)
(sum level33 level13 level46)
(sum level33 level18 level51)
(sum level34 level11 level45)
(sum level34 level13 level47)
(sum level34 level18 level52)
(sum level35 level11 level46)
(sum level35 level13 level48)
(sum level35 level18 level53)
(sum level36 level11 level47)
(sum level36 level13 level49)
(sum level36 level18 level54)
(sum level37 level11 level48)
(sum level37 level13 level50)
(sum level37 level18 level55)
(sum level38 level11 level49)
(sum level38 level13 level51)
(sum level38 level18 level56)
(sum level39 level11 level50)
(sum level39 level13 level52)
(sum level39 level18 level57)
(sum level40 level11 level51)
(sum level40 level13 level53)
(sum level40 level18 level58)
(sum level41 level11 level52)
(sum level41 level13 level54)
(sum level41 level18 level59)
(sum level42 level11 level53)
(sum level42 level13 level55)
(sum level42 level18 level60)
(sum level43 level11 level54)
(sum level43 level13 level56)
(sum level43 level18 level61)
(sum level44 level11 level55)
(sum level44 level13 level57)
(sum level44 level18 level62)
(sum level45 level11 level56)
(sum level45 level13 level58)
(sum level45 level18 level63)
(sum level46 level11 level57)
(sum level46 level13 level59)
(sum level46 level18 level64)
(sum level47 level11 level58)
(sum level47 level13 level60)
(sum level47 level18 level65)
(sum level48 level11 level59)
(sum level48 level13 level61)
(sum level48 level18 level66)
(sum level49 level11 level60)
(sum level49 level13 level62)
(sum level49 level18 level67)
(sum level50 level11 level61)
(sum level50 level13 level63)
(sum level50 level18 level68)
(sum level51 level11 level62)
(sum level51 level13 level64)
(sum level51 level18 level69)
(sum level52 level11 level63)
(sum level52 level13 level65)
(sum level52 level18 level70)
(sum level53 level11 level64)
(sum level53 level13 level66)
(sum level53 level18 level71)
(sum level54 level11 level65)
(sum level54 level13 level67)
(sum level54 level18 level72)
(sum level55 level11 level66)
(sum level55 level13 level68)
(sum level55 level18 level73)
(sum level56 level11 level67)
(sum level56 level13 level69)
(sum level56 level18 level74)
(sum level57 level11 level68)
(sum level57 level13 level70)
(sum level57 level18 level75)
(sum level58 level11 level69)
(sum level58 level13 level71)
(sum level58 level18 level76)
(sum level59 level11 level70)
(sum level59 level13 level72)
(sum level59 level18 level77)
(sum level60 level11 level71)
(sum level60 level13 level73)
(sum level60 level18 level78)
(sum level61 level11 level72)
(sum level61 level13 level74)
(sum level61 level18 level79)
(sum level62 level11 level73)
(sum level62 level13 level75)
(sum level63 level11 level74)
(sum level63 level13 level76)
(sum level64 level11 level75)
(sum level64 level13 level77)
(sum level65 level11 level76)
(sum level65 level13 level78)
(sum level66 level11 level77)
(sum level66 level13 level79)
(sum level67 level11 level78)
(sum level68 level11 level79)

(connected l0 l1)
(fuelcost level18 l0 l1)
(connected l0 l2)
(fuelcost level11 l0 l2)
(connected l1 l0)
(fuelcost level18 l1 l0)
(connected l1 l2)
(fuelcost level13 l1 l2)
(connected l2 l0)
(fuelcost level11 l2 l0)
(connected l2 l1)
(fuelcost level13 l2 l1)

(at t0 l2)
(fuel t0 level79)
(= (total-cost) 0)

(at p0 l0)
(at p1 l1)
(at p2 l1)
(at p3 l0)
(at p4 l1)
(at p5 l2)
(at p6 l0)
(at p7 l1)
(at p8 l2)
(at p9 l0)
(at p10 l0)
(at p11 l2)
)

(:goal
(and
(at p0 l2)
(at p1 l2)
(at p2 l0)
(at p3 l2)
(at p4 l2)
(at p5 l0)
(at p6 l2)
(at p7 l2)
(at p8 l1)
(at p9 l2)
(at p10 l1)
(at p11 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p8 t0 l2)
   deleted: (at p8 l2)
   added: (in p8 t0)
   goals met: 0 of 12
2. (load p5 t0 l2)
   deleted: (at p5 l2)
   added: (in p5 t0)
   goals met: 0 of 12
3. (load p11 t0 l2)
   deleted: (at p11 l2)
   added: (in p11 t0)
   goals met: 0 of 12
4. (drive t0 l2 l1 level66 level13 level79)
   deleted: (at t0 l2) (fuel t0 level79)
   added: (at t0 l1) (fuel t0 level66)
   goals met: 0 of 12
5. (unload p11 t0 l1)
   deleted: (in p11 t0)
   added: (at p11 l1)
   goals met: 1 of 12
6. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 1 of 12
7. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 1 of 12
8. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 1 of 12
9. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 1 of 12
10. (drive t0 l1 l0 level48 level18 level66)
   deleted: (at t0 l1) (fuel t0 level66)
   added: (at t0 l0) (fuel t0 level48)
   goals met: 1 of 12
11. (unload p5 t0 l0)
   deleted: (in p5 t0)
   added: (at p5 l0)
   goals met: 2 of 12
12. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 3 of 12
13. (load p9 t0 l0)
   deleted: (at p9 l0)
   added: (in p9 t0)
   goals met: 3 of 12
14. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 3 of 12
15. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 3 of 12
16. (load p10 t0 l0)
   deleted: (at p10 l0)
   added: (in p10 t0)
   goals met: 3 of 12
17. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 3 of 12
18. (drive t0 l0 l1 level30 level18 level48)
   deleted: (at t0 l0) (fuel t0 level48)
   added: (at t0 l1) (fuel t0 level30)
   goals met: 3 of 12
19. (unload p10 t0 l1)
   deleted: (in p10 t0)
   added: (at p10 l1)
   goals met: 4 of 12
20. (unload p8 t0 l1)
   deleted: (in p8 t0)
   added: (at p8 l1)
   goals met: 5 of 12
21. (drive t0 l1 l2 level17 level13 level30)
   deleted: (at t0 l1) (fuel t0 level30)
   added: (at t0 l2) (fuel t0 level17)
   goals met: 5 of 12
22. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 6 of 12
23. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 7 of 12
24. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 8 of 12
25. (unload p4 t0 l2)
   deleted: (in p4 t0)
   added: (at p4 l2)
   goals met: 9 of 12
26. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 10 of 12
27. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 11 of 12
28. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 12 of 12
